OpenQBMM-OpenFOAM-v2306/validation/polydisperseBubbleFoam/Diaz/Diaz_7_1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(
    boxToCell
    {
        box (-0.5 0 0) (0.5 0.45 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.air       0
            volScalarFieldValue moment.0.air    0
            volScalarFieldValue moment.1.air    0
            volScalarFieldValue moment.2.air    0
            volScalarFieldValue moment.3.air    0
            volScalarFieldValue moment.4.air    0
            volScalarFieldValue moment.5.air    0
        );
    }
);


// ************************************************************************* //
